{
  "7": {
    "Economic_Focus": "National independence and prosperity through democratic and unified governance",
    "Political_Focus": "Establishment of a provisional democratic coalition government for unifying political parties and groups",
    "Social_Focus": "Liberation and unity against Japanese aggression",
    "Overall_Summary": "The document analyzes the situation in WWII China, advocating for a united front against Japanese aggression and the formation of a provisional democratic coalition government. It highlights the need for democratic reforms, national unity, and liberation, and contrasts the approaches of the Communist Party and the Kuomintang."
  },
  "8": {
    "Economic_Focus": "Socialist transformation of agriculture, handicrafts, and capitalist industry and commerce",
    "Political_Focus": "Building a great socialist country, strengthening socialist construction and international relations",
    "Social_Focus": "Transformation of national bourgeois elements from exploiters into working people, elevation of the working class",
    "Overall_Summary": "The report reflects on the achievements since the Seventh Congress, including the establishment of the People's Republic of China and victories in socialist transformation. It highlights the emergence of China as an independent, sovereign state free from foreign imperialism, the elevation of the working class, and the consolidation of the people's democratic united front. The central task is building a socialist China, involving the continued transformation of agriculture, handicrafts, and industry, and enhancing China's international position."
  },
  "9": {
    "Economic_Focus": "Socialist transformation of ownership in agriculture, handicrafts, and industry",
    "Political_Focus": "Strengthening the dictatorship of the proletariat, advancing the socialist revolution in the superstructure",
    "Social_Focus": "Addressing revisionism, consolidating political power of the proletariat",
    "Overall_Summary": "The congress convened following the victory in the Great Proletarian Cultural Revolution, aimed at shattering bourgeois elements and strengthening the dictatorship of the proletariat. It emphasized the completion of socialist transformation in various economic sectors and the need to continue the socialist revolution in cultural and political realms. The focus was on maintaining and advancing socialism, ensuring stability in industrial and agricultural production, and engaging in international relations that support these goals."
  },
  "10": {
    "Economic_Focus": "Continued progress in socialist construction in industry, agriculture, transportation, finance, and trade",
    "Political_Focus": "Upholding the political and organizational lines of the Ninth Congress, consolidating the dictatorship of the proletariat",
    "Social_Focus": "Rectifying style of work and conducting revolutionary mass criticism, fostering a deeper understanding of Marxism",
    "Overall_Summary": "The Tenth National Congress convened post the victory against the Lin Piao anti-Party clique, affirming the correctness of the Ninth Congress's political and organizational lines. It highlighted achievements in socialist construction, stability in various economic sectors, and advances in culture, education, public health, and science. The Congress emphasized the importance of continuing the revolution under the dictatorship of the proletariat, enhancing unity against imperialist aggression and modern revisionism, and striving to build China into a powerful socialist state."
  },
  "11": {
    "Economic_Focus": "Revitalization of production post-overthrow of the 'gang of four', significant growth in industrial and agricultural sectors",
    "Political_Focus": "Continuation of the struggle against Right and 'Left' opportunism, adherence to Mao's revolutionary line",
    "Social_Focus": "Combating the 'gang of four's' distortion of Mao's theory and political line, class struggle between the proletariat and bourgeoisie",
    "Overall_Summary": "The congress convened in the aftermath of Chairman Mao's death, focusing on the continuation of his revolutionary line and the victories against imperialism, landlord class, and bureaucrat-bourgeoisie. It highlighted the struggle against the 'gang of four', who sought to usurp Party power and restore capitalism, and their ultimate defeat, which led to a boost in production and morale. The report reaffirms China's commitment to Mao's theories, including the differentiation of the three worlds, and emphasizes the significant progress in international relations and domestic production."
  },
  "12": {
    "Economic_Focus": "Shift to economic construction, implementing principles of readjustment, restructuring, consolidation, and improvement for steady growth",
    "Political_Focus": "Rectification of Party's guiding ideology, overcoming 'Left' mistakes, and reaffirming Marxist lines",
    "Social_Focus": "Overcoming ideological and political challenges, developing a modern, regular revolutionary army, and enhancing national defense",
    "Overall_Summary": "The 12th CCP Congress report emphasized the historic changes following the Jiang Qing clique's downfall, focusing on rectifying the Party's ideology and correcting 'Left' errors. It highlighted ideological renovation, economic redirection towards construction, and strengthening national defense. The Party remodeled itself, learning from past mistakes, including those made during the Cultural Revolution, and it aimed to balance criticism of past errors while avoiding one-sided views, thereby promoting a well-rounded Marxist approach."
  },
  "14": {
    "Economic_Focus": "Development of a socialist market economy, economic restructuring, and reliance on scientific and technological progress",
    "Political_Focus": "Reform as a motive force for socialist development, improvement of the people's congresses, development of socialist democracy",
    "Social_Focus": "Building an advanced socialist culture and ideology, developing a skilled and disciplined citizenry",
    "Overall_Summary": "The 14th CCP Congress report emphasized the path to socialism with Chinese characteristics, acknowledging China's primary stage of socialism. It focused on the liberation and development of productive forces to eliminate exploitation and achieve common prosperity. The report underscored the need for economic restructuring to develop a socialist market economy and political restructuring for improving the system of people's congresses and multiparty cooperation. It highlighted the importance of creating favorable international conditions for modernization and adhering to an independent foreign policy of peace. The report also reaffirmed the four cardinal principles as the political guarantee for socialist construction and outlined a strategic plan for socialist construction in stages, emphasizing the role of the CCP and the people's armed forces in leading and supporting the socialist cause."
  },
  "15": {
    "Economic_Focus": "Seizing opportunities for new breakthroughs in economic restructuring",
    "Political_Focus": "Deepening political restructuring and developing socialist culture and ethics",
    "Social_Focus": "All-round social progress and advancement of the Chinese nation",
    "Overall_Summary": "The 15th National Congress of the Communist Party of China was pivotal, marking a transition into the 21st century. It emphasized carrying out Deng Xiaoping's directives and advancing the cause of building socialism with Chinese characteristics. The Congress focused on seizing opportunities to innovate, prioritizing economic development, deepening economic and political restructuring, and developing socialist culture and ethics. Reflecting on the significant transformations in China's history, it recognized the roles of pivotal figures like Sun Yat-sen, Mao Zedong, and Deng Xiaoping in shaping the nation's destiny."
  },
  "16": {
    "Economic Focus": "Sustained rapid and sound development of the national economy, with emphasis on stimulating domestic demand, strategic adjustment of the economic structure, and improving agricultural foundation and high-tech industries.",
    "Political Focus": "Improving socialist democracy and spiritual civilization, advancing political restructuring, strengthening democracy and legal systems, and promoting political and ethnic unity.",
    "Social Focus": "Building a well-off society in an all-round way, focusing on public welfare, education, culture, health, sports, and improving the overall quality of life.",
    "Overall Summary": "The document outlines the CPC's strategic plan for modernizing China in the new century, emphasizing economic growth, political development, and social progress. Key themes include enhancing the national economy, promoting technological advancements, fostering democratic governance, and improving the social well-being and cultural life of the people. The report also highlights efforts in national defense, anti-corruption, and the importance of Party leadership in achieving these goals."
  },
  "17": {
    "Economic_Focus": "Substantial increase in economic strength, sustained growth of GDP, improved national revenue, stable prices, balanced regional development, and progress in innovation and infrastructure",
    "Political_Focus": "Advancement of socialism with Chinese characteristics, reform, and opening up, scientific development, social harmony, and achieving a moderately prosperous society by 2020",
    "Social_Focus": "Significant improvement in living standards, increased urban and rural incomes, enhanced public services, and establishment of subsistence allowances for the poor",
    "Overall_Summary": "The 17th CCP Congress Report emphasizes China's crucial stage of reform and development. It focuses on upholding socialism with Chinese characteristics, pursuing scientific development, promoting social harmony, and striving for a prosperous society by 2020. Economic achievements include rapid GDP growth, improved national revenue, and balanced regional development. Socially, there's notable improvement in living standards and public services. The political agenda is centered on socialism with Chinese characteristics, reform, opening up, and scientific development to ensure social harmony and prosperity."
  },
  "18": {
    "Economic Focus": "Steady and rapid development of the economy, considerable growth in national strength, advancements in industrial structure, infrastructure upgrade, urbanization, innovation, ecological progress, resource conservation, and environmental protection.",
    "Political Focus": "Development of democracy and the legal system, progress in political structure reform, establishment of a socialist system of laws with Chinese characteristics, and advancements in the reform of the administrative and judicial systems.",
    "Social Focus": "Significant progress in social development, improvement in basic public services, rapid development of education, establishment of a comprehensive social security system, and maintenance of social harmony and stability.",
    "Overall Summary": "The 18th CCP Congress Report highlights China's achievements in various fields over the past five years, including economic, political, and social domains. It emphasizes the steady and rapid economic development, the strengthening of national power, and improvements in various sectors like agriculture, technology, and urbanization. Politically, the report focuses on the development of democracy, legal reforms, and the improvement of judicial systems. Socially, it discusses advancements in public services, education, and social security, aiming to maintain social harmony and stability. The overarching theme is the pursuit of a moderately prosperous society, emphasizing socialism with Chinese characteristics, innovation, and a focus on the people's wellbeing."
  },
  "19": {
    "Economic Focus": "Major achievements in economic development, including growth in GDP, advancements in the economic structure, and leadership in global economic contributions.",
    "Political Focus": "Significant steps in developing democracy and the rule of law, including improvements in socialist democracy, law enforcement, and judicial impartiality.",
    "Social Focus": "Steady improvement in living standards, with initiatives for poverty alleviation, educational development, and enhanced public health and medical services.",
    "Overall Summary": "The report highlights China's progress in various sectors over the past five years. It emphasizes economic growth, with China maintaining a strong position in the global economy and making strides in infrastructure and technological innovation. Politically, the focus has been on developing democracy and advancing law-based governance. Socially, there has been a concerted effort to improve living standards, reduce poverty, and enhance public services. The report also underscores the commitment to addressing unbalanced and inadequate development and meeting the increasing needs of the people for a better life. Overall, the report reflects the Party's drive towards national rejuvenation, maintaining the original aspiration of seeking happiness for the Chinese people and rejuvenation for the Chinese nation."
  },
  "20": {
    "Economic Focus": "High-quality development, strengthening national defense, modernizing the armed forces, enhancing ecological conservation, and creating a new pattern of development.",
    "Political Focus": "Strengthening the overall leadership of the Party, centralized unified leadership of the Central Committee, and advancing the cause of the Party and the country.",
    "Social Focus": "People-centered philosophy of development, ensuring access to childcare, education, employment, medical services, elderly care, housing, and social assistance, improving public wellbeing.",
    "Overall Summary": "The document emphasizes the CCP's commitment to leading China through significant economic, political, and social changes. It highlights efforts to strengthen the Party's leadership, pursue high-quality economic development, and focus on a people-centered development philosophy. Key achievements include improving public wellbeing, advancing national defense and security, and fostering a democratic, culturally advanced, harmonious society. The report outlines strategies for economic growth, innovation, rural revitalization, and promoting a harmonious relationship between humanity and nature, all under the centralized leadership of the CCP."
  }
}
